tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# work
cask "iterm2"
cask "docker"
cask "ngrok"
cask "licecap"
cask "visual-studio-code"
cask "linear-linear"
cask "google-cloud-sdk"

# personal
cask "dropbox"
cask "google-chrome"
cask "firefox"
cask "slack"
cask "discord"
cask "spotify"
cask "caffeine"
cask "notion"
cask "anki"
cask "skype"
cask "tunnelbear"
cask "notion"
cask "steam"
cask "utm"

# signed-commits
# cask "keybase"
brew "gpg2"
brew "gnupg"
brew "pinentry-mac"

brew "fish"
brew "asdf"
brew "git"
brew "tig"
brew "bash-completion"
brew "exercism"
brew "postgresql@14", restart_service: true
brew "redis", restart_service: true
brew "the_silver_searcher"
brew "neovim"
brew "z"
brew "heroku/brew/heroku"
brew "tmate"
brew "imagemagick"
brew "gnu-sed"

# asdf nodejs
brew "coreutils"

# asdf erlang
brew "autoconf"
# brew "wxwidgets" # causes erlang compilation to fail, don't install for now
brew "openssl@1.1"
brew "libxslt"
brew "fop"
brew "python3"

# work
brew "nginx"
brew "nss"
brew "mkcert"
brew "dnsmasq"

# other apps

# will prompt for password
cask "zoom"

# inconsistent source availability
cask "vlc"
cask "qbittorrent"
