tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# asdf nodejs
brew "coreutils"
brew "gpg"

# asdf erlang
brew "autoconf"

# neovim
brew "python3"

brew "git"
brew "bash-completion"
brew "exercism"
brew "gnupg"
brew "grip"
brew "postgresql", restart_service: true
brew "redis", restart_service: true
brew "the_silver_searcher"
brew "tmux"
brew "neovim"
brew "wxmac"
brew "z"
brew "heroku/brew/heroku"
brew "bash-completion"
brew "tig"
brew "asdf"
brew "git-standup"

cask "iterm2"
cask "docker"
cask "dropbox"
cask "google-chrome"
cask "slack"
cask "spotify"
cask "ngrok"
cask "licecap"
cask "postman"
cask "synergy"
cask "vlc"
cask "rescuetime"
cask "caffeine"
cask "viber"
cask "telegram"
cask "evernote"
cask "zoomus"
cask "anki"
cask "discord"
cask "skype"
cask "qbittorrent"
