tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# asdf nodejs
brew "coreutils"
brew "gpg"
# asdf erlang
brew "autoconf"
brew "wxmac"
brew "openssl@1.1"
# neovim
brew "python3"
# keybase
brew "pinentry-mac"

brew "asdf"
brew "git"
brew "tig"
brew "bash-completion"
brew "exercism"
brew "gnupg"
brew "postgresql", restart_service: true
brew "redis", restart_service: true
brew "the_silver_searcher"
brew "neovim"
brew "z"
brew "heroku/brew/heroku"
brew "tmate"

brew "imagemagick"

# apps
cask "authy"
cask "iterm2"
cask "docker"
cask "dropbox"
cask "google-chrome"
cask "firefox"
cask "slack"
cask "discord"
cask "spotify"
cask "ngrok"
cask "licecap"
cask "caffeine"
cask "notion"
cask "anki"
cask "skype"
cask "visual-studio-code"
cask "tunnelbear"
cask "linear-linear"

# will prompt for password
cask "rescuetime"
cask "zoom"
# github signed commits
cask "keybase"

# inconsistent source availability / download speed
cask "vlc"
cask "qbittorrent"
