jorgebucaran/fisher
jethrokuan/z
edc/bass
lgathy/google-cloud-sdk-fish-completion
jethrokuan/fzf
jhillyerd/plugin-git
gazorby/fish-abbreviation-tips
evanlucas/fish-kubectl-completions
